#include <stdio.h>

int map[10][10], ch[10][10];
int dx[4] = {-1, 0, 1, 0};
int dy[4] = {0, 1, 0, -1};
int cnt = 0;

void DFS(int x, int y){
    int i, nx, ny;//xx는 앞으로 갈 격자를 파악하기 위한 것
    
    //도착한 경우
    if(x==8 && y==7){
        cnt++;
    } else {
        for(i=0;i<4;i++){
            nx = x + dx[i];
            ny = y + dy[i];
            
            //범위를 벗어나는 경우, continue
            if(nx<1 || nx>7 || ny<1 || ny>7) 
                continue;
            
            //가려고 하는 곳이 갈 수 있는 곳이며, 지나가지 않았던 지점인 경우
            if(map[nx][ny]==0 && ch[nx][ny]==0){
                ch[nx][ny]=1;
                DFS(nx, ny);
                ch[nx][ny]=0;
            }
        }
    }
}


int main() {
    char map[6][21] = {
        "11111111111111111111",
        "10000C00C000000C0001",
        "10000000P00000000001",
        "10000000100000000001",
        "10000000E100000C0011",
        "11111111111111111111"
    };
    
    char **visit = {
        "11111111111111111111",
        "10000C00C000000C0001",
        "10000000P00000000001",
        "10000000100000000001",
        "10000000E100000C0011",
        "11111111111111111111"
    }

    return 0;
}